import 'package:turbo_app/core/networking/api_error_model.dart';

class ApiResult<T> {

//todo عملت 3 كلاسات بحالتين الاتنين بيرثو من الكلاس الرئيسي ال هوا اي بي اي ريزلت 
  // هنا انا عملت كلاس جديد علشان يرجع احتمال من احتمالين 
  //وحددت نوع الكلاس هنا قولتلو انا هخليك جينيريك يعني نوع انا عامله من دماغي اي نوع بس انا عارف ان الريتيرن هيرجع مثلا من النوع تي علشان انا محدد نوع تي 

  when({
    //عملت الوين بتاعتي 
    // اديتها في  الكونستراكتور حاجتين او حالتين من نوع فنكشن 
    required  Function(T data) onSuccess,
    //الاول الطبيعي انه لو صحيح  هيرجع في الفنكشن براميتر من نوع  تي ودا هيكون مستقبل الداتا ودا هيكون في الحاله بتاعتنا بتاعة اون لساكسيس 

    required  Function(ApiErrorModel error) onError,
    //النوع التاني عندنا بردو من نوع فنكسن هيستقبل في البرامتر بتاعه ال الايرور ودا طبعا هيكون من نوع اي بي اي ايرور مودل 
    // الايرور مودل دا بيستقبل 3 حاجات بيتقبل ماسج الخطا وبيستقبل ايقون وبيستقبل الاستيتس كود بتاع الخطأ وسميته اون ايرور 
  }) {
    if (this is ApiSuccess<T>) {
      // هنا بقوله لو الحاله اي بي اي ساكسيس 
      return onSuccess((this as ApiSuccess<T>).data);

      //هنا بتقوله يا برنس لو رجعت اون ساكسيس عاوزك تساوي القيمه بالكلاس ال اسمه تحت اي بي اي ساكسيس 

      // هترجعلي بقا يعم 
   //الداتا لو الحاله ناجحه الداتا ال داخل الكلاس ال اسمه اي بي اي اكسيس
   // وهترجع الداتا ال رجعالي في الكلاس تحت بقا 

    } else {

      // والا اكيد الراجع ايرور ف 
      // ةهترجعلي بقا اي الكونستراكتور ال في الكلاس الرئيسي وهتساويه بال الكلاس ال اسمه اي بي اي ايرور 
// وهترجع الايرور ال موجود في الكلاس تحت 
      return onError((this as ApiError).error);
    }
  }

  static Future error(ApiErrorModel handle) async {}
}

class ApiSuccess<T> extends ApiResult<T> {
  //هنا عملت كلاس  اسمه اي بي اي ساكسس  من نوع تي وبيورث من الكلاس الرئيسي 

  final T data;
  //باصيتلو ال داتا ال من نوع تي 

  ApiSuccess({required this.data});
}

class ApiError<T> extends ApiResult<T> {
  // هنا عملت كلاس تاني خاص بان الريسبونس لو رجعلي ايرور بقا 
  //عملت كلاس وخليته يورث من الكلاس الرئيسي 

  final ApiErrorModel error;
  //باصيتله هنا الايرور بقا من نوع اي بي اي ايرور مودل 

  ApiError({required this.error});
}
